---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSettings.SetPressLossCalculationServerInfo(Autodesk.Revit.DB.MEPCalculationServerInfo)
source: html/8632a1d8-5126-ead1-985e-ade923e55461.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.SetPressLossCalculationServerInfo Method

Set the MEPServerInfo of the current pipe pressure loss calculation server.

## Syntax (C#)
```csharp
public void SetPressLossCalculationServerInfo(
	MEPCalculationServerInfo serverInfo
)
```

## Parameters
- **serverInfo** (`Autodesk.Revit.DB.MEPCalculationServerInfo`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null